app/Controllers/Cart.php

    public function index()
    {
        // Obtener los productos del carrito de la base de datos
        // Utiliza el modelo CartModel para acceder a los datos
        $cartItems = $this->cartModel->findAll();
---
SELECT *
FROM `carts`