app/Controllers/Detalle_producto_controller.php

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function CargarPagina($id)
    {
        $productModel = new Detalle_producto_modelo;

        $datos['result'] = $productModel->find($id);